Картриджи/src/AccumulationRegisters/ОстаткиКартриджей/ОстаткиКартриджей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиКартриджей</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Картридж</name>
    <type>
      <types>CatalogRef.МоделиКартриджей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделения</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Картриджи/src/Enums/СтатусыКартриджей/СтатусыКартриджей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКартриджей</name>
  <enumValues>
    <name>Полный</name>
  </enumValues>
  <enumValues>
    <name>Пустой</name>
  </enumValues>
  <enumValues>
    <name>Неисправный</name>
  </enumValues>
  <enumValues>
    <name>НаЗапрвке</name>
  </enumValues>
  <enumValues>
    <name>Списанный</name>
  </enumValues>
</mdclass:Enum>

Картриджи/src/Catalogs/МоделиКартриджей/МоделиКартриджей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МоделиКартриджей</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Принтера</name>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>CatalogRef.Принтера</types>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.Производители</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Картриджи/src/CommonForms/ФормаПодбора/Module.bsl
Перем ТЗ;

&НаСервере
Процедура ПолучитьТзДляПередачи()
  	    
	Запрос = Новый Запрос;
	Запрос.Текст = 	
		"ВЫБРАТЬ
		|	ОстаткиКартриджейОстатки.Картридж,
		|	ОстаткиКартриджейОстатки.Подразделения,
		|	ОстаткиКартриджейОстатки.КоличествоОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.ОстаткиКартриджей.Остатки(&ДатаСреза, Подразделения = &ВыбПодразделения) КАК ОстаткиКартриджейОстатки
		|ГДЕ
		|	ОстаткиКартриджейОстатки.КоличествоОстаток > 0";
	
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата());
	Запрос.УстановитьПараметр("ВыбПодразделения", ВыбПодразделение);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ТЗПодбора.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	   	
	Если Параметры.Свойство("ИмяДокумента") Тогда
		
		ИмяДокумента = Параметры.ИмяДокумента;
		
		Если ИмяДокумента = "ПоступлениеКартриджей" Тогда			
			
			ПолучитьТЗПодбора();
			
		ИначеЕсли Параметры.ИмяДокумента  = "ПриемПередачаКартриджей" Тогда
			
			ВыбПодразделение = Параметры.ОснПодразделение;
			//ОтборПоКартриджу  = Параметры.ПользовПодразделение.Принтер;
			ПолучитьТзДляПередачи();
			
		КонецЕсли;
	
	КонецЕсли; 
		
	ТЗПодбораДоОтбора.Загрузить(ТЗПодбора.Выгрузить());
	
КонецПроцедуры
 
&НаСервере
Процедура ПолучитьТЗПодбора()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МоделиКартриджей.Ссылка КАК Картридж
		|ИЗ
		|	Справочник.МоделиКартриджей КАК МоделиКартриджей";
	
	Результат = Запрос.Выполнить();
	
	Тз = Результат.Выгрузить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НовояСтрока = ТЗПодбора.Добавить();
		НовояСтрока.Картридж = ВыборкаДетальныеЗаписи.Картридж;
		
	КонецЦикла;
		
КонецПроцедуры // ПолучитьТзПодбора()

&НаКлиенте
Процедура ТзПодбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
	
	//Добавляем строки или количество в таблицу для переноса из таблицы для отбора	
	Отбор = Новый Структура;
	Отбор.Вставить("Картридж", ТекущиеДанные.Картридж);
	
	НайденныеЗначения = ТЗПереноса.НайтиСтроки(Отбор);
	
	Если НайденныеЗначения.Количество() = 0 Тогда		
		
		НовСтр = ТЗПереноса.Добавить();	
		НовСтр.Картридж = ТекущиеДанные.Картридж;	
		НовСтр.Остаток  = 1;          
		
	Иначе
		
		Для Каждого НайденноеЗначение Из НайденныеЗначения Цикл
			НайденноеЗначение.Остаток = НайденноеЗначение.Остаток + 1;
		КонецЦикла;
		
	КонецЕсли;
	
	//Удаляем строки или количество из первоначальной таблицы отбора
	Если ИмяДокумента <> "ПоступлениеКартриджей" Тогда
		
		Отбор.Вставить("Подразделения", ТекущиеДанные.Подразделения);
		
		НайденныеЗначения = ТЗПодбора.НайтиСтроки(Отбор);
		
		Для Каждого НайденноеЗначение из НайденныеЗначения Цикл		
			
			НайденноеЗначение.Остаток = НайденноеЗначение.Остаток - 1;
			
			Если НайденноеЗначение.Остаток = 0 Тогда
				ТЗПодбора.Удалить(НайденноеЗначение);                              
			КонецЕсли;
			
		КонецЦикла;
		
		НайденныеЗначения = ТЗПодбораДоОтбора.НайтиСтроки(Отбор);
		
		Для Каждого НайденноеЗначение из НайденныеЗначения Цикл		
			
			НайденноеЗначение.Остаток = НайденноеЗначение.Остаток - 1;
			
			Если НайденноеЗначение.Остаток = 0 Тогда
				ТЗПодбораДоОтбора.Удалить(НайденноеЗначение);                              
			КонецЕсли;                             
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Пренос(Команда)
		                      	
	Если ИмяДокумента = "ПоступлениеКартриджей" Тогда
		
		Для каждого Стр ИЗ ТЗПереноса Цикл
			
			НоваяСтрока = ВладелецФормы.Объект.Картриджи.Добавить();
			НоваяСтрока.Картриджи     = Стр.Картридж;
			НоваяСтрока.Производитель = ПолучитьПроизводителя(Стр.Картридж);
			НоваяСтрока.Количество    = Стр.Остаток;
			
		КонецЦикла;
		
	ИначеЕсли ИмяДокумента = "ПриемПередачаКартриджей"  Тогда
		
		ВладелецФормыОбъект = ВладелецФормы.Объект;			
		
		Для каждого СтрокаТЧ ИЗ ТЗПереноса Цикл                         
			
			НоваяСтрока = ВладелецФормыОбъект.Передача.Добавить();			
						
			НоваяСтрока.Картридж   = СтрокаТЧ.Картридж;					
			НоваяСтрока.Количество = СтрокаТЧ.Остаток;
			
		КонецЦикла;
		
	КонецЕсли;
 	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатусПустой()

	Возврат Перечисления.СтатусыКартриджей.Пустой;	

КонецФункции // ПолучитьСтатусПустой()

&НаСервереБезКонтекста
Функция ВидПодразделения(Подразделение)

	Возврат Подразделение.ВидПодразделения;	

КонецФункции // ВидПодразделения()
     
&НаСервере
Функция ПолучитьПроизводителя(Картридж)
	
	Возврат Картридж.Производитель;
	
КонецФункции // ПолучитьПроизводителя()

&НаКлиенте
Процедура ОтборПоПринтеруПриИзменении(Элемент)
		
	ОтборПоПринтеруНаСервере(ОтборПоКартриджу);
		
КонецПроцедуры

&НаСервере
Процедура ОтборПоПринтеруНаСервере(Картридж)
	      	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МоделиКартриджей.Ссылка
	               |ПОМЕСТИТЬ ВТ_Картриджи
	               |ИЗ
	               |	Справочник.МоделиКартриджей КАК МоделиКартриджей
	               |ГДЕ
	               |	МоделиКартриджей.Ссылка В(&Картридж)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПодбора.Картридж,
	               |	ТаблицаПодбора.Подразделения,
	               |	ТаблицаПодбора.Остаток
	               |ПОМЕСТИТЬ ВТ_ТаблицаПодбора
	               |ИЗ
	               |	&ТаблицаПодбора КАК ТаблицаПодбора
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаПодбора.Картридж,
	               |	ВТ_ТаблицаПодбора.Подразделения,
	               |	ВТ_ТаблицаПодбора.Остаток
	               |ИЗ
	               |	ВТ_ТаблицаПодбора КАК ВТ_ТаблицаПодбора
	               |ГДЕ
	               |	ВТ_ТаблицаПодбора.Картридж В
	               |			(ВЫБРАТЬ
	               |				ВТ_Картриджи.Ссылка
	               |			ИЗ
	               |				ВТ_Картриджи КАК ВТ_Картриджи)";
	
	Запрос.УстановитьПараметр("Картридж", Картридж);	
	Запрос.УстановитьПараметр("ТаблицаПодбора", ТЗПодбораДоОтбора.Выгрузить()); 
	
	Результат = Запрос.Выполнить();
	
	ТЗПодбора.Очистить();
	
	Если Не Результат.Пустой() Тогда
		
		ТЗПодбора.Загрузить(Результат.Выгрузить());
			
	КонецЕсли; 
		
КонецПроцедуры
    
&НаКлиенте
Процедура ОтборПоПринтеруАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ОтборПоПринтеруНаСервере(Текст);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКартинку(Картридж)
	
	КартинкаАдрес = ПолучитьНавигационнуюСсылку(Картридж.ОсновноеИзображение,"Хранилище");
	Элементы.Картинка.РазмерКартинки = РазмерКартинки.АвтоРазмер;

КонецПроцедуры // УстановитьКартинку() 

&НаКлиенте
Процедура ТзПодбораПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТзПодбора.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	УстановитьКартинку(ТекущиеДанные.Картридж);	
	
КонецПроцедуры
